Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/housing/losing_your_home/agencies_for_homeless_people.html.txt.tmx
Source language: en
Languages: ga

source: Agencies providing services for homeless people
ga: Gníomhaireachtaí a sholáthraíonn seirbhísí do dhaoine gan dídean

source: • Accessing social welfare payments
ga: • Íocaíochtaí leasa shóisialaigh a rochtain

source: This document lists a number of agencies and organisations that provide services to people who are homeless or at risk
ga: Tugtar faisnéis achomair sa cháipéis seo ar roinnt gníomhaireachtaí agus eagraíochtaí a sholáthraíonn seirbhísí do dhaoine nach bhfuil aon chóiríocht acu

source: While they are listed under the main type of service provided, many of these bodies provide multiple supports to homeless people, including advice and information on other options available to them
ga: Cé go bhfuil na heagraíochtaí liostaithe de réir an phríomhchineáil seirbhíse a sholáthraíonn siad, cuireann cuid mhór acu roinnt tacaí éagsúla ar fáil do dhaoine gan dídean, lena n-áirítear comhairle agus faisnéis ar roghanna eile atá ar fáil dóibh

source: A growing number of people are either homeless or at risk of losing their homes
ga: San am i láthair, tá méadú ag teacht ar líon na ndaoine atá gan dídean nó atá i mbaol a dtithe a chailleadh

source: Most of them are in the cities
ga: Tá formhór na ndaoine gan dídean le fáil sna cathracha, go háirithe i mBaile Átha Cliath

source: There are dedicated services for homeless people in Dublin and Cork
ga: Is ann do sheirbhísí dílse do dhaoine gan dídean i mBaile Átha Cliath agus i gCorcaigh

source: If you find yourself homeless or you think you may lose your home, you should generally contact your local authority to access accommodation
ga: • Seirbhísí feabhsaithe i gcomhair daoine a chodlaíonn amuigh, leithdháileadh ar thithe sóisialta ó thaobh tosaíochta de agus feidhmiú na hÍocaíochta Cúnaimh Tithíochta (ICT) le haghaidh teaghlaigh gan dídean atá ina teideal –go léir lonnaithe i mBaile Átha Cliath

source: In Dublin and Cork, contact the specialist services listed below
ga: • An tSeirbhís um Chosaint Tionóntacht a leathnú (féach thíos) go Corcaigh

source: Outside of Dublin and Cork, contact your local Community Welfare office
ga: • Measúnú a dhéanamh ar an méid daoine gan dídean i gCorcaigh, i Luimneach, i nGaillimh agus i bPort Láirge agus na gníomhaíochtaí atá de dhíth a aithint

source: The Housing First Service in the Dublin region provides street outreach to people who are sleeping rough and helps them to access emergency accommodation
ga: Maidir le daoine i gCorcaigh agus sa cheantar máguaird a mbaineann an cás céanna leo, tá an tseirbhís seo ar fáil 9am-1pm agus 2pm-5pm, Luan go hAoine

source: It also works to secure longer-term accommodation with extensive supports
ga: Taobh amuigh de Bhaile Átha Cliath agus Corcaigh, déan teagmháil le d ‘Oifigeach Leas Pobail áitiúil

source: If you are in the Dublin region, already getting Rent Supplement and at risk of losing your home, contact the Tenancy Protection Service at 1800 454 454 from 9am-9pm Monday to Friday or email tps@threshold.ie
ga: Is iad seo a leanas na sainseirbhísí cóiríochta i mBaile Átha Cliath agus i gCorcaigh

source: For Irish citizens and UK citizens:
ga: Munar saoránach thú d'Éirinn ná den Ríocht Aontaithe

source: Dublin City Council’s Central Placement Service for homeless people is open from 10 am to 12 noon and from 2pm to 4pm, Monday to Friday, at: Parkgate Hall, 6-9 Conyngham Road, Dublin 8
ga: Tá an Lársheirbhís Socrúcháin do dhaoine gan dídean atá á reáchtáil ag Comhairle Cathrach Bhaile Átha Cliath ar oscailt ó 10am go meán lae agus ó 2pm go 4pm, an Luan go dtí an Aoine, ag: Halla Gheata na Páirce, 6-9 Bóthar Conyngham, Baile Átha Cliath 8

source: Tel: 1800 707 707 (24-hour helpline)
ga: Teil.: 1800 707 707 (líne chabhrach 24 uair)

source: Fingal County Council’s Assessment and Placement service is available from 10am to 12.30pm and 2.30pm to 3.30pm, Monday to Friday at: Housing Department, Fingal County Council, Grove Road, Blanchardstown, Dublin 15
ga: Tá Seirbhís Measúnaithe agus Socrúcháin Chomhairle Contae Fhine Gall ar fáil ó 10rn go 12.30in agus ó 2.30in go 3.30in, Luan go hAoine ag: An Rannóg Tithíochta, Comhairle Contae Fhine Gall, Bóthar an Gharráin, Baile Bhlainséir, Baile Átha Cliath 15

source: Tel: (01) 890 5090
ga: Teil: (01) 890 5090

source: Dún Laoghaire-Rathdown County Council’s Assessment and Placement service is available from 10am to 6pm Monday to Friday at: Housing Department, Dún Laoghaire-Rathdown County Council, County Hall, Marine Road, Dún Laoghaire, Co
ga: Tá Seirbhís Measúnaithe agus Socrúcháin Chomhairle Contae Dhún Laoghaire-Ráth an Dúin ar fáil ó 10rn go 6in, an Luan go dtí an Aoine ag: An Rannóg Tithíochta, Comhairle Contae Dhún Laoghaire-Ráth an Dúin, Áras an Chontae, Bóthar na Mara, Dún Laoghaire, Co

source: Tel: (01) 205 4700
ga: Teil: (01) 205 4700

source: South Dublin County Council’s Assessment and Placement service is available from 10am to 12 noon and 2.30pm to 4pm, Monday to Friday at: Housing Department, South Dublin County Council, County Hall, Tallaght, Dublin 24
ga: Tá Seirbhís Measúnaithe agus Socrúcháin Chomhairle Contae Bhaile Átha Cliath Theas ar fáil ó 10rn go meán lae agus ó 2.30in go 4in, an Luan go dtí an Aoine ag: An Rannóg Tithíochta, Comhairle Contae Bhaile Átha Cliath Theas, Áras an Chontae, Tamhlacht, Baile Átha Cliath 24

source: Tel: (01) 414 9000
ga: Teil: (01) 414 9000

source: If you are not an Irish citizen and not a UK citizen:
ga: Munar saoránach thú d'Éirinn ná den Ríocht Aontaithe

source: Homeless Persons Unit, 77 Upper Gardiner Street, Dublin 1; 10am–11.30am, 2pm–3.30pm.Tel: (01) 673 2030
ga: Aonad na nDaoine gan Dídean, 77 Sráid Ghairdinéir Uachtarach, Baile Átha Cliath 1: ó 10rn go 11.30rn agus ó 2in go 3.30in. Teil.: (01) 673 2030

source: Cork City Council’s outreach worker is available at various times and locations during the week. These are listed in the guide to homeless emergency services published by Cork City Homeless Forum
ga: Tá oibrí for-rochtana Chomhairle Cathrach Chorcaí ar fáil ag amanna éagsúla agus in áiteanna éagsúla le linn na seachtaine

source: This also lists the emergency accommodation for homeless people in Cork City, as well as other services available
ga: Tá na hamanna agus na háiteanna sin liostaithe sa treoir maidir le seirbhísí éigeandála do dhaoine gan dídean (Béarla) arna foilsiú ag Fóram Easpa Dídine Chathair Chorcaí

source: If you are in Cork City and the immediate area, already getting Rent Supplement and at risk of losing your home, contact the Tenancy Protection Service at 1800 454 454 from 9am-1pm and 2pm-5pm Monday to Friday or email tps@threshold.ie
ga: Liostaítear sa treoir sin freisin an chóiríocht éigeandála atá ar fáil do dhaoine gan dídean i gCathair Chorcaí, mar aon le seirbhísí eile atá ar fáil

source: Accessing social welfare payments
ga: Íocaíochtaí leasa shóisialaigh a rochtain

source: In general, you make any claims for social welfare payments such as Jobseeker’s Allowance; for illness and disability payments; for Rent Supplement and for other Supplementary Welfare Allowance payments in the normal way
ga: I gcás daoine atá lonnaithe lasmuigh de Bhaile Átha Cliath agus de Chorcaigh, téigh chuig d’oifig leasa pobail chun iarratas a dhéanamh ar Fhorlíonadh Cíosa agus ar íocaíochtaí eile Liúntais Leasa Fhorlíontaigh

source: In Dublin and Cork, there are Homeless Persons Units (HPUs) to deal with claims for Supplementary Welfare Allowance (including Rent Supplement) and to help with claims for other payments
ga: I gcás daoine atá lonnaithe i mBaile Átha Cliath nó i gCorcaigh, tá Aonaid Daoine gan Dídean (HPUnna) ann a dhéileálann le héilimh ar Liúntas Leasa Forlíontach (Forlíonadh Cíosa san áireamh) agus a chabhraíonn le héilimh ar íocaíochtaí eile

source: The units can also help with applications for medical cards and can provide information on other services that may be relevant to your circumstances
ga: Is féidir leis na haonaid cabhrú freisin le hiarratais ar chártaí leighis agus is féidir leo faisnéis a chur ar fáil ar sheirbhísí eile a d’fhéadfadh bheith ábhartha maidir le do chúinsí

source: Homeless Persons Unit for men, at Community Welfare Service, Department of Social Protection, North Cumberland Street*, Dublin 1, Monday to Friday
ga: Aonad na nDaoine gan Dídean le haghaidh na bhfear, Seirbhís Leasa Pobail, Roinn Coimirce Sóisialaí, Sráid Cumberland Thuaidh, Baile Átha Cliath 1, Luan go hAoine

source: Phone: (01) 673 2575, Freephone: 1800 724 724, Fax: (01) 675 5749
ga: Teil: 01 673 2575, Saortheil: 1800 724 724, Facs: 01 675 5749

source: Clinic times by appointment
ga: Uaireanta chlinic ar coinne amháin

source: Freephone 1800 724 724 to make an appointment
ga: Saortheil: 1800 724 724 tchun coinne a dhéanamh

source: Homeless Persons Unit for women and families, 77 Upper Gardiner Street, Dublin 1; 10am–11.30am, 2pm–3.30pm.Tel: (01) 673 2030
ga: Aonad na nDaoine gan Dídean le haghaidh ban agus teaghlach l77 Sráid Gardiner Uachtarach, Baile Átha Cliath 1; 10rn–11.30rn, 2in–3.30in

source: Homeless Persons Unit - Cork
ga: Munar saoránach thú d'Éirinn ná den Ríocht Aontaithe

source: The Homeless Persons Unit in 3 Drinan Street, (off Sullivan's Quay), Cork is open from 9.30am to 11.30am. Monday to Friday
ga: Aonad na nDaoine gan Dídean, 77 Sráid Ghairdinéir Uachtarach, Baile Átha Cliath 1: ó 10rn go 11.30rn agus ó 2in go 3.30in

source: Tel: (021) 4805 490
ga: Teil.: (01) 673 2030

source: City Council Outreach Worker is available Tuesday afternoons by appointment only
ga: Tá oibrí for-rochtana de chuid na Comhairle Cathrach ar fáil). Teil.: (021) 496 3052

source: Several voluntary organisations get government funding to provide temporary and permanent accommodation for homeless people and to provide advice and assistance to them
ga: Faigheann roinnt eagraíochtaí deonacha cistiúchán ón rialtas chun cóiríocht shealadach agus bhuan a chur ar fáil do dhaoine gan dídean agus chun comhairle agus cúnamh a thabhairt dóibh

source: Of these, the main ones are:
ga: Is iad seo a leanas na príomheagraíochtaí díobh siúd:

source: Simon Communities in Ireland: simon.ie
ga: Clanna Shíomóin na hÉireann: simon.ie

source: St Vincent de Paul: svp.ie
ga: Cumann Naomh Uinseann de Pól: svp.ie

source: De Paul Trust: depaulireland.org
ga: Iontaobhas de Pól: depaulireland.org

source: Peter McVerry Trust: pmvtrust.ie
ga: Iontaobhas Peter McVerry: pmvtrust.ie

source: Threshold and Trust also provide advice and assistance to homeless people
ga: Soláthraíonn Threshold agus Trust comhairle agus cúnamh do dhaoine gan dídean freisin

source: Some members of the Irish Council for Social Housing (voluntary housing organisations) offer services and supports to homeless people
ga: Cuireann roinnt ball de Chomhairle na hÉireann um Thithíocht Sóisialta (eagraíochtaí tithíochta deonaí) seirbhísí agus tacaí ar fáil do dhaoine gan dídean

source: You may be eligible for housing services if you are legally resident in Ireland and you have been living in the relevant local authority area for a specific length of time
ga: Más rud é go bhfuil cónaí ort go dlíthiúil in Éirinn agus go gcónaíonn tú i limistéar an údaráis áitiúil iomchuí le tréimhse shonrach ama, is féidir go mbeidh tú incháilithe do sheirbhísí tithíochta

source: If you are not eligible for long-term housing assistance you may get temporary help from an emergency homelessness service
ga: Mura bhfuil tú incháilithe do chúnamh fadtéarmach tithíochta, is féidir go bhfaighidh tú cuidiú sealadach ó sheirbhís éigeandála do dhaoine gan dídean

source: The following two organisations provide specific advice and information:
ga: Cuireann an dá eagraíocht seo a leanas sainchomhairle agus sainfhaisnéis ar fáil:

source: Crosscare Refugee Service provides information, advocacy, support and referral services to refugees and asylum seekers who need help with, among other things, social welfare payments, housing – particularly for those who are homeless or at risk of homelessness
ga: Soláthraíonn Seirbhís Crosscare do Dhídeanaithe faisnéis, tathant, tacaíocht agus seirbhísí atreoraithe do dhídeanaithe agus d’iarrthóirí tearmainn óna dteastaíonn cuidiú le híocaíochtaí leasa shóisialaigh agus le tithíocht i measc nithe eile – go háirithe i gcás daoine atá gan dídean nó atá i mbaol easpa dídine

source: Crosscare, 2 Sackville Place, Dublin 1
ga: Crosscare, 2 Plás Sackville, Baile Átha Cliath 1

source: Tel: (01) 873 2844
ga: Teil.: (01) 873 2844

source: Migrant Rights Centre Ireland (MRCI) provides information, advocacy and assistance on social welfare entitlements
ga: Soláthraíonn Ionad Cearta Imirceach Éireann (MRCI) faisnéis, tathant agus cúnamh i leith teidlíochtaí leasa shóisialaigh

source: The resource centre offers a frontline drop in service, and a phone and email service to assist with queries nationally
ga: Tairgeann an t-ionad acmhainní sin seirbhís túslíne ‘bualadh isteach’ agus seirbhís teileafóin agus ríomhphoist chun freastal ar cheisteanna ó gach cearn den tír

source: Migrant Rights Centre Ireland, 55 Parnell Square West, Dublin 1
ga: Ionad Cearta Imirceach Éireann, 55 Cearnóg Parnell Thiar, Baile Átha Cliath 1

source: Tel: (01) 889 7570
ga: Teil.: (01) 889 7570

source: The Dublin Region Homeless Executive, which is responsible for co-ordinating services for homeless people in Dublin, has published a listing of services in Dublin
ga: Tá liosta seirbhísí atá ar fáil i mBaile Átha Cliath (Béarla) foilsithe ag Feidhmeannacht Easpa Dídine Réigiún Bhaile Átha Cliath, atá freagrach as seirbhísí do dhaoine gan dídean a chomhordú i mBaile Átha Cliath

source: The Cork City Homeless Forum has produced a guide to homeless emergency services in Cork
ga: Tá treoir maidir le seirbhísí éigeandála do dhaoine gan dídean i gCorcaigh (Béarla) curtha le chéile ag Fóram Easpa Dídine Chathair Chorcaí

source: For more information, you can contact your local Citizens Information Centre
ga: Le haghaidh tuilleadh faisnéise, is féidir leat teagmháil a dhéanamh leis an Ionad Eolais do Shaoránaigh is gaire duit
